app/services/content_tags_service.rb

SELECT "content_tags".* FROM "content_tags"
---
  def initialize
    @content_tags = ContentTag.all

    @opening_tags = []
    @closing_tags = []

    @content_tags.each do |ct|