app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT  "articles".* FROM "articles" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]