app/controllers/content_tags_controller.rb

SELECT "content_tags".* FROM "content_tags"
---
  def index
    @content_tags = ContentTag.all

SELECT  "content_tags".* FROM "content_tags" WHERE "content_tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @content_tag = ContentTag.find(params[:id])

SELECT  "content_tags".* FROM "content_tags" WHERE "content_tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "content_tags" SET "html" = $1, "color" = $2, "updated_at" = $3 WHERE "content_tags"."id" = $4  [["html", "<strong>"], ["color", "dc3545"], ["updated_at", "2019-01-12 16:55:52.451462"], ["id", 2]]
---
  def update
    @content_tag = ContentTag.find(params[:id])

    if @content_tag.update(content_tag_params)