app/controllers/home_controller.rb

  def index
    @article = Article.order('RANDOM()').first
---
SELECT  "articles".* FROM "articles" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]